app/controllers/movies_controller.rb

    def index
      @all_ratings = Movie.all_ratings
      @all_ratings_as_hash = {}
      @all_ratings.each do |i|
---
SELECT "movies".* FROM "movies"